# Panalyt Data Engineering Assignment 

By [Shubhanshu Gupta](https://shubhanshugupta.com/contact/)

In [1]:
import pandas as pd
import urllib.request
import json
import numpy as np

### Reading the excel file

In [2]:
data = pd.ExcelFile('data_task.xlsx')

### Reading the two sheets of excel file

In [3]:
job = pd.read_excel(data, 'job')
salary = pd.read_excel(data, 'salary')

In [4]:
job.head()

       Employee       Date Location Division     Emp ID
0  XXX501004YYY 2018-08-20     M-KL        M  XXX501004
1  XXX212468YYY 2018-08-06     I-HA        I  XXX212468
2  XXX212468YYY 2018-10-09      I-A        I  XXX212468
3  XXX212270YYY 2017-11-01     I-HA        I  XXX212270
4  XXX212270YYY 2018-10-09      I-A        I  XXX212270

In [5]:
salary.head()

       Employee Effective Date       Salary Paid Per Employee Number
0  XXX501004YYY     2018-08-20     MYR 7800    Month       XXX501004
1  XXX501004YYY     2019-04-01     MYR 8640    Month       XXX501004
2  XXX212468YYY     2018-08-06  IDR 4800000    Month       XXX212468
3  XXX212468YYY     2019-01-01  IDR 5400000    Month       XXX212468
4  XXX212270YYY     2017-11-01  IDR 4800000    Month       XXX212270

### Splitting the location in Job dataframe to country and office. Subsequently, dropped the location column

In [6]:
job[['country','office']] = job['Location'].str.split('-',expand=True)

In [7]:
job.drop('Location', axis=1, inplace=True)
job.head()

       Employee       Date Division     Emp ID country office
0  XXX501004YYY 2018-08-20        M  XXX501004       M     KL
1  XXX212468YYY 2018-08-06        I  XXX212468       I     HA
2  XXX212468YYY 2018-10-09        I  XXX212468       I      A
3  XXX212270YYY 2017-11-01        I  XXX212270       I     HA
4  XXX212270YYY 2018-10-09        I  XXX212270       I      A

### Splitting the Salary in salary dataframe to currency and salary. Subsequently, dropped the original Salary column

In [8]:
salary[['currency','salary']] = salary['Salary'].str.split(' ',expand=True)
salary.head()

,Employee,Effective Date,Salary,Paid Per,Employee Number,currency,salary
0,XXX501004YYY,2018-08-20,MYR 7800,Month,XXX501004,MYR,7800
1,XXX501004YYY,2019-04-01,MYR 8640,Month,XXX501004,MYR,8640
2,XXX212468YYY,2018-08-06,IDR 4800000,Month,XXX212468,IDR,4800000
3,XXX212468YYY,2019-01-01,IDR 5400000,Month,XXX212468,IDR,5400000
4,XXX212270YYY,2017-11-01,IDR 4800000,Month,XXX212270,IDR,4800000

In [9]:
salary.drop('Salary', axis=1, inplace=True)
salary.head()

       Employee Effective Date Paid Per Employee Number currency   salary
0  XXX501004YYY     2018-08-20    Month       XXX501004      MYR     7800
1  XXX501004YYY     2019-04-01    Month       XXX501004      MYR     8640
2  XXX212468YYY     2018-08-06    Month       XXX212468      IDR  4800000
3  XXX212468YYY     2019-01-01    Month       XXX212468      IDR  5400000
4  XXX212270YYY     2017-11-01    Month       XXX212270      IDR  4800000

## Function to fetch current exchange rates

I have created a dictionary here to store the exchange rate of the currency against USD. The idea is to store the exchange rates once and then use them (from dictionary) to convert the salary in local currency to USD.
Used https://exchangeratesapi.io/ API for fetching exchange rates.

In [10]:
usd_exchange_rates = dict()
def get_usd_exchange_rates(base_currency):
    try:
        if base_currency not in usd_exchange_rates:
            contents = urllib.request.urlopen("https://api.exchangeratesapi.io/latest?base="+str(base_currency)+"&symbols=USD").read()
            exchange_rates = json.loads(contents.decode('UTF-8'))
            usd_exchange_rates[base_currency] = exchange_rates['rates']['USD']            
    except Exception as e:
        print("Error in fetching exchange rate. " + str(e))

In [11]:
salary.apply(lambda x: get_usd_exchange_rates(x['currency']), axis=1)
usd_exchange_rates

{'MYR': 0.2431293752,
 'IDR': 7.12454e-05,
 'PHP': 0.0195503744,
 'THB': 0.0323464313,
 'SGD': 0.735105827}

## Function to convert local currency into USD

In [12]:
def get_salary_in_usd(currency, salary):
    return round(usd_exchange_rates[currency]*float(salary), 2)

In [13]:
# Example
get_salary_in_usd('MYR', '2800')

680.76

### Apply the method to the entire column

In [14]:
salary['usd_salary'] = salary.apply(lambda x: get_salary_in_usd(x['currency'] ,x['salary']), axis=1)

### Filling all NAs with Month value

In [15]:
salary['Paid Per'].fillna('Month', inplace=True)

### Converting the daily salary to monthly salary

In [16]:
salary.loc[salary['Paid Per']=='Day', 'usd_salary'] = salary.loc[salary['Paid Per']=='Day']['usd_salary']*22

In [17]:
salary.loc[salary['Paid Per']=='Day', 'Paid Per'] = 'Month'

In [18]:
salary.head()

,Employee,Effective Date,Paid Per,Employee Number,currency,salary,usd_salary
0,XXX501004YYY,2018-08-20,Month,XXX501004,MYR,7800,1896.41
1,XXX501004YYY,2019-04-01,Month,XXX501004,MYR,8640,2100.64
2,XXX212468YYY,2018-08-06,Month,XXX212468,IDR,4800000,341.98
3,XXX212468YYY,2019-01-01,Month,XXX212468,IDR,5400000,384.73
4,XXX212270YYY,2017-11-01,Month,XXX212270,IDR,4800000,341.98

In [19]:
job.head()

       Employee       Date Division     Emp ID country office
0  XXX501004YYY 2018-08-20        M  XXX501004       M     KL
1  XXX212468YYY 2018-08-06        I  XXX212468       I     HA
2  XXX212468YYY 2018-10-09        I  XXX212468       I      A
3  XXX212270YYY 2017-11-01        I  XXX212270       I     HA
4  XXX212270YYY 2018-10-09        I  XXX212270       I      A

In [20]:
job.shape

(3815, 6)

In [21]:
job.loc[job['Employee']=='XXX212468YYY']

       Employee       Date Division     Emp ID country office
1  XXX212468YYY 2018-08-06        I  XXX212468       I     HA
2  XXX212468YYY 2018-10-09        I  XXX212468       I      A

In [22]:
salary.loc[salary['Employee']=='XXX212468YYY']

,Employee,Effective Date,Paid Per,Employee Number,currency,salary,usd_salary
2,XXX212468YYY,2018-08-06,Month,XXX212468,IDR,4800000,341.98
3,XXX212468YYY,2019-01-01,Month,XXX212468,IDR,5400000,384.73

### Doing an outer join on Job and Salary dataframes on Employee and Date columns. Retaining only Employee, Date and USD salary columns from Salary dataframe

In [23]:
merged_df = pd.merge(job, salary[['Employee','Effective Date', 'usd_salary']], how='outer', left_on=['Employee', 'Date'], right_on = ['Employee', 'Effective Date'])

In [24]:
merged_df.head()

,Employee,Date,Division,Emp ID,country,office,Effective Date,usd_salary
0,XXX501004YYY,2018-08-20,M,XXX501004,M,KL,2018-08-20,1896.41
1,XXX212468YYY,2018-08-06,I,XXX212468,I,HA,2018-08-06,341.98
2,XXX212468YYY,2018-10-09,I,XXX212468,I,A,NaT,NaN
3,XXX212270YYY,2017-11-01,I,XXX212270,I,HA,2017-11-01,341.98
4,XXX212270YYY,2018-10-09,I,XXX212270,I,A,NaT,NaN

## Assumptions

1. If an employee has record in Salary dataframe for an effective date and no record in Job dataframe for the same effective date, I have assumed that the employee was in the same division, country and office as in the preceeding row.
2. If an employee has a record in Job dataframe for an effective date and no record in Salary dataframe for the same effective date, I have assumed that the employee was on same salary as before (last drawn salary of the most recent effective date).

### Sorting the merged dataframe by employee and date column. Doing this because I want to forward fill the NAs with the values in preceeding rows.

In [25]:
merged_df = merged_df.sort_values(['Employee', 'Date']).reset_index(drop=True)

In [26]:
# Example 1
merged_df.loc[merged_df['Employee']=='XXX101549YYY']

,Employee,Date,Division,Emp ID,country,office,Effective Date,usd_salary
975,XXX101549YYY,2016-09-01,R,XXX101549,T,HQ,2016-09-01,1868.01
976,XXX101549YYY,2018-04-01,R,XXX101549,T,HQ,2018-04-01,2377.46
977,XXX101549YYY,2018-04-20,R,XXX101549,T,HQ,NaT,NaN
978,XXX101549YYY,2018-07-17,R,XXX101549,T,HQ,NaT,NaN
979,XXX101549YYY,NaT,NaN,NaN,NaN,NaN,2017-04-01,1924.05
980,XXX101549YYY,NaT,NaN,NaN,NaN,NaN,2019-04-01,2472.56

In [27]:
# Example 2
merged_df.loc[merged_df['Employee']=='XXX212468YYY']

,Employee,Date,Division,Emp ID,country,office,Effective Date,usd_salary
3939,XXX212468YYY,2018-08-06,I,XXX212468,I,HA,2018-08-06,341.98
3940,XXX212468YYY,2018-10-09,I,XXX212468,I,A,NaT,NaN
3941,XXX212468YYY,NaT,NaN,NaN,NaN,NaN,2019-01-01,384.73

## Following Assumption number 1. 
If there's no value in Date field from Job dataframe (NAs as a result of join), I am filling the effective date from salary dataframe.

In [28]:
merged_df.loc[merged_df['Date'].isnull(),'Date'] = merged_df['Effective Date']

## Following Assumption number 2. 
If there's no value in Date field from Salary dataframe (NAs as a result of join), I am filling the effective date from job dataframe.

In [29]:
merged_df.loc[merged_df['Effective Date'].isnull(),'Effective Date'] = merged_df['Date']

## Forward filling the NAs

In [30]:
merged_df = merged_df.fillna(method='ffill')

In [31]:
merged_df

,Employee,Date,Division,Emp ID,country,office,Effective Date,usd_salary
0,XXX101000YYY,2014-07-01,T,XXX101000,T,HQ,2014-07-01,NaN
1,XXX101000YYY,2018-02-14,T,XXX101000,T,HQ,2018-02-14,NaN
2,XXX101000YYY,2012-07-01,T,XXX101000,T,HQ,2012-07-01,2109.25
3,XXX101000YYY,2017-04-01,T,XXX101000,T,HQ,2017-04-01,2172.55
4,XXX101000YYY,2018-04-01,T,XXX101000,T,HQ,2018-04-01,2227.86
5,XXX101000YYY,2019-04-01,T,XXX101000,T,HQ,2019-04-01,2258.59
6,XXX101001YYY,2012-11-01,T,XXX101001,T,HQ,2012-11-01,1428.90
7,XXX101001YYY,2017-04-01,T,XXX101001,T,HQ,2017-04-01,1470.39
8,XXX101001YYY,2017-07-01,T,XXX101001,T,HQ,2017-07-01,1597.91
9,XXX101001YYY,2018-06-01,T,XXX101001,T,HQ,2018-06-01,1597.91
10,XXX101001YYY,2019-02-04,T,XXX101001,T,HQ,2019-02-04,1597.91
11,XXX101001YYY,2019-03-01,T,XXX101001,T,HQ,2019-03-01,1597.91
12,XXX101001YYY,2018-04-01,T,XXX101001,T,HQ,2018-04-01,1674.74
13,XXX101001YYY,2019-04-01,T,XXX101001,T,HQ,2019-04-01,1720.83
14,XXX101002YYY,2013-02-07,T,XXX101002,T,HQ,2013-02-07,8714.78
15,XXX101002YYY,2017-07-17,T,XXX101002,T,HQ,2017-07-17,8714.78
16,XXX101002YYY,2017-09-13,T,XXX101002,T,HQ,2017-09-13,8714.78
17,XXX101002YYY,2017-09-22,T,XXX101002,T,HQ,2017-09-22,8714.78
18,XXX101002YYY,2018-04-19,T,XXX101002,T,HQ,2018-04-19,8714.78
19,XXX101002YYY,2017-04-01,T,XXX101002,T,HQ,2017-04-01,9365.62
20,XXX101002YYY,2017-09-01,T,XXX101002,T,HQ,2017-09-01,9737.59
21,XXX101003YYY,2013-04-01,R,XXX101003,T,HQ,2013-04-01,9218.73
22,XXX101003YYY,2018-03-14,R,XXX101003,T,HQ,2018-03-14,9218.73
23,XXX101003YYY,2018-04-01,R,XXX101003,T,HQ,2018-04-01,10819.72
24,XXX101004YYY,2013-04-17,T,XXX101004,T,R,2013-04-17,990.38
25,XXX101004YYY,2016-04-01,T,XXX101004,T,R,2016-04-01,990.38
26,XXX101004YYY,2016-09-08,T,XXX101004,T,R,2016-09-08,990.38
27,XXX101004YYY,2017-04-01,T,XXX101004,T,R,2017-04-01,1086.84
28,XXX101004YYY,2017-07-17,T,XXX101004,T,R,2017-07-17,1086.84
29,XXX101004YYY,2017-09-27,T,XXX101004,T,L,2017-09-27,1086.84
...,...,...,...,...,...,...,...,...
5739,XXXS00009YYY,2018-12-17,T,XXXS00009,T,L,2018-12-17,304.26
5740,XXXS00009YYY,2019-03-01,T,XXXS00009,T,L,2019-03-01,304.26
5741,XXXS00010YYY,2018-12-17,T,XXXS00010,T,L,2018-12-17,304.26
5742,XXXS00010YYY,2019-03-01,T,XXXS00010,T,L,2019-03-01,304.26
5743,XXXS00011YYY,2018-12-17,T,XXXS00011,T,L,2018-12-17,288.20
5744,XXXS00011YYY,2019-03-01,T,XXXS00011,T,L,2019-03-01,288.20
5745,XXXS00012YYY,2018-12-17,T,XXXS00012,T,L,2018-12-17,384.34
5746,XXXS00012YYY,2019-03-01,T,XXXS00012,T,L,2019-03-01,384.34
5747,XXXS00013YYY,2018-12-17,T,XXXS00013,T,L,2018-12-17,288.20
5748,XXXS00013YYY,2019-03-01,T,XXXS00013,T,L,2019-03-01,288.20
5749,XXXS00014YYY,2018-12-17,T,XXXS00014,T,L,2018-12-17,288.20
5750,XXXS00014YYY,2019-03-01,T,XXXS00014,T,L,2019-03-01,288.20
5751,XXXS00015YYY,2018-12-17,T,XXXS00015,T,L,2018-12-17,304.26
5752,XXXS00015YYY,2019-03-01,T,XXXS00015,T,L,2019-03-01,304.26
5753,XXXS00016YYY,2018-12-17,T,XXXS00016,T,L,2018-12-17,304.26
5754,XXXS00016YYY,2019-03-01,T,XXXS00016,T,L,2019-03-01,304.26
5755,XXXS00017YYY,2018-12-17,T,XXXS00017,T,L,2018-12-17,384.34
5756,XXXS00017YYY,2019-03-01,T,XXXS00017,T,L,2019-03-01,384.34
5757,XXXS00018YYY,2018-12-17,T,XXXS00018,T,L,2018-12-17,304.26
5758,XXXS00018YYY,2019-03-01,T,XXXS00018,T,L,2019-03-01,304.26
5759,XXXS00019YYY,2018-11-01,T,XXXS00019,T,L,2018-11-01,439.34
5760,XXXS00019YYY,2019-01-01,T,XXXS00019,T,L,2019-01-01,439.34
5761,XXXS00019YYY,2019-03-01,T,XXXS00019,T,L,2019-03-01,439.34
5762,XXXS00019YYY,2018-12-01,T,XXXS00019,T,L,2018-12-01,405.68
5763,XXXS00020YYY,2018-11-07,T,XXXS00020,T,L,2018-11-07,439.34
5764,XXXS00020YYY,2019-01-01,T,XXXS00020,T,L,2019-01-01,439.34
5765,XXXS00020YYY,2019-03-01,T,XXXS00020,T,L,2019-03-01,439.34
5766,XXXS00020YYY,2018-12-01,T,XXXS00020,T,L,2018-12-01,405.68
5767,XXXS00023YYY,2018-12-01,T,XXXS00023,T,L,2018-12-01,427.02
5768,XXXS00023YYY,2019-03-01,T,XXXS00023,T,L,2019-03-01,427.02